Section_4_Real_Workload_Validation/Experiment13/data/raw/case-A/sustained-ramp/trial_001/noisy-load.txt
Running 3m test @ http://127.0.0.1:18081/
  2 threads and 50 connections
  Thread calibration: mean lat.: 18.727ms, rate sampling interval: 51ms
  Thread calibration: mean lat.: 18.679ms, rate sampling interval: 51ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.65ms   23.49ms 418.05ms   95.64%
    Req/Sec   100.78     90.83   627.00     43.76%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.71ms
 75.000%   21.33ms
 90.000%   30.54ms
 99.000%  123.46ms
 99.900%  339.45ms
 99.990%  393.98ms
 99.999%  418.30ms
100.000%  418.30ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.407     0.000000            1         1.00
      13.831     0.100000         3412         1.11
      14.895     0.200000         6807         1.25
      15.815     0.300000        10196         1.43
      16.735     0.400000        13586         1.67
      17.711     0.500000        16990         2.00
      18.223     0.550000        18722         2.22
      18.767     0.600000        20378         2.50
      19.391     0.650000        22101         2.86
      20.223     0.700000        23784         3.33
      21.327     0.750000        25484         4.00
      22.223     0.775000        26320         4.44
      23.359     0.800000        27166         5.00
      24.495     0.825000        28019         5.71
      25.983     0.850000        28864         6.67
      28.111     0.875000        29713         8.00
      29.215     0.887500        30139         8.89
      30.543     0.900000        30560        10.00
      32.287     0.912500        30986        11.43
      34.655     0.925000        31410        13.33
      38.015     0.937500        31832        16.00
      40.095     0.943750        32045        17.78
      42.719     0.950000        32257        20.00
      46.143     0.956250        32471        22.86
      50.783     0.962500        32682        26.67
      57.023     0.968750        32894        32.00
      60.383     0.971875        33000        35.56
      64.511     0.975000        33106        40.00
      69.567     0.978125        33212        45.71
      76.799     0.981250        33318        53.33
      86.591     0.984375        33424        64.00
      94.207     0.985938        33477        71.11
     103.743     0.987500        33531        80.00
     113.919     0.989062        33583        91.43
     129.343     0.990625        33636       106.67
     154.239     0.992188        33689       128.00
     167.679     0.992969        33716       142.22
     181.119     0.993750        33742       160.00
     191.487     0.994531        33769       182.86
     207.615     0.995313        33795       213.33
     219.391     0.996094        33823       256.00
     227.455     0.996484        33835       284.44
     233.727     0.996875        33848       320.00
     241.279     0.997266        33862       365.71
     256.255     0.997656        33875       426.67
     273.151     0.998047        33888       512.00
     283.135     0.998242        33895       568.89
     293.375     0.998437        33901       640.00
     311.807     0.998633        33908       731.43
     327.167     0.998828        33915       853.33
     339.967     0.999023        33921      1024.00
     349.695     0.999121        33925      1137.78
     358.655     0.999219        33928      1280.00
     363.519     0.999316        33931      1462.86
     368.639     0.999414        33936      1706.67
     371.711     0.999512        33938      2048.00
     372.735     0.999561        33940      2275.56
     372.991     0.999609        33941      2560.00
     376.063     0.999658        33943      2925.71
     376.575     0.999707        33946      3413.33
     376.575     0.999756        33946      4096.00
     377.855     0.999780        33947      4551.11
     378.367     0.999805        33948      5120.00
     388.095     0.999829        33949      5851.43
     388.863     0.999854        33950      6826.67
     388.863     0.999878        33950      8192.00
     393.983     0.999890        33951      9102.22
     393.983     0.999902        33951     10240.00
     415.487     0.999915        33952     11702.86
     415.487     0.999927        33952     13653.33
     415.487     0.999939        33952     16384.00
     415.999     0.999945        33953     18204.44
     415.999     0.999951        33953     20480.00
     415.999     0.999957        33953     23405.71
     415.999     0.999963        33953     27306.67
     415.999     0.999969        33953     32768.00
     418.303     0.999973        33954     36408.89
     418.303     1.000000        33954          inf
#[Mean    =       22.653, StdDeviation   =       23.493]
#[Max     =      418.048, Total count    =        33954]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  36002 requests in 3.00m, 29.29MB read
Requests/sec:    199.99
Transfer/sec:    166.59KB